<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"5c008955b42c1de46963bfde95cbad8cb7ca856e615b6a6dc016dc3fe45e3699","plan_job_ref":"Job Run Terraform plan in staging #169 at https://github.com/GSA-TTS/continuous-assessment-poc/actions/runs/12951064713","plan_out_hash":"d9eeb13e27dc631b573175ae5cce5722e68212a0fdab3c75602fc1ed6f15986f","plan_hash":"cf135f416b46ce2dfc8a4525feddb39fc83514bc0a6fbaf3add2f003441cc703","plan_text_format":"diff","version":"1.46.0"} -->
Terraform plan in __terraform__
With var files: `terraform/staging.tfvars`
<details>
<summary>Plan: 0 to add, 2 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place

Terraform will perform the following actions:

  # cloudfoundry_network_policy.egress_routing will be updated in-place
!~  resource "cloudfoundry_network_policy" "egress_routing" {
        id = "05a74ebf-eccc-3593-abce-90c94c007b39"

-       policy {
-           destination_app = "b7becb44-b1cd-412a-8d0a-ff01e55044b5" -> null
-           port            = "61443" -> null
-           protocol        = "tcp" -> null
-           source_app      = "99121ff6-67ff-485d-bf03-d92ed152bf51" -> null
        }
-       policy {
-           destination_app = "b7becb44-b1cd-412a-8d0a-ff01e55044b5" -> null
-           port            = "8080" -> null
-           protocol        = "tcp" -> null
-           source_app      = "99121ff6-67ff-485d-bf03-d92ed152bf51" -> null
        }
+       policy {
+           destination_app = (known after apply)
+           port            = "61443"
+           protocol        = "tcp"
+           source_app      = "99121ff6-67ff-485d-bf03-d92ed152bf51"
        }
+       policy {
+           destination_app = (known after apply)
+           port            = "8080"
+           protocol        = "tcp"
+           source_app      = "99121ff6-67ff-485d-bf03-d92ed152bf51"
        }
    }

  # module.egress_proxy.cloudfoundry_app.egress_app will be updated in-place
!~  resource "cloudfoundry_app" "egress_app" {
!~      created_at                  = "2024-12-26T21:32:43Z" -> (known after apply)
!~      disk_quota                  = "2048M" -> (known after apply)
!~      health_check_type           = "port" -> (known after apply)
!~      id                          = "************************************" -> (known after apply)
!~      log_rate_limit_per_second   = "-1" -> (known after apply)
        name                        = "egress-proxy-staging"
!~      readiness_health_check_type = "process" -> (known after apply)
!~      source_code_hash            = "af00d9f0ed4f5adb1116397a9f6dcc7dd456903620ea757caf405265c9ab1746" -> "1d819ae858cd42078f02e263ffec500b9b3ce6b784fb33e072fbc783910ae498"
!~      stack                       = "cflinuxfs4" -> (known after apply)
!~      updated_at                  = "2025-01-16T21:34:16Z" -> (known after apply)
#        (10 unchanged attributes hidden)
    }

Plan: 0 to add, 2 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Run Terraform plan in staging #169](https://github.com/GSA-TTS/continuous-assessment-poc/actions/runs/12951064713)